{"sections":{"main":{"type":"page-template","disabled":true,"settings":{}},"89209ef1-7e25-4cf1-86f8-7158aeee0fd1":{"type":"loyalty-new","settings":{}},"1644918874e4f539b9":{"type":"faq","blocks":{"1644918874f596d5111-1":{"type":"content","settings":{"title":"1. How do I use my Loyalty Points as a new user?","answer":"<p>- Welcome! As a new user, you'd be credited RM25 worth of points (5,000 pts). In order to use it, you'll need to have a total of 7,000 pts.This means that you'll need to earn an extra 2,000 pts in order to be eligible to use your RM25 worth of points!<\/p>"}},"1644918874f596d511-1":{"type":"content","settings":{"title":"2. How do I convert loyalty points into vouchers?","answer":"<p>- In order to convert points into voucher, you will need to login to your Trapo account and claim the vouchers according to your needs.<\/p>"}},"1644918874f596d511-2":{"type":"content","settings":{"title":"3. How do I redeem free gifts using loyalty points ?","answer":"<p>- Login to your Trapo account and select the designated free gift redemption. Apply the code at the discount section upon adding it to cart. Please do note that shipping fee would be imposed exclusively for free gift redemption and would be beared by customer itself.<\/p>"}},"1644918874f596d511-3":{"type":"content","settings":{"title":"4. Is there any T&C when applying vouchers into the order?","answer":"<p>- Customer would need to spend at least half or more based on the total price of the item added into the cart in comparison to the voucher value.<\/p>"}},"1644918874f596d511-5":{"type":"content","settings":{"title":"5. Is there any expiry date for the loyalty lion points?","answer":"<p>- Loyalty points would be valid for a year. However, if there’s any purchase being made within that year itself, the points lifespan will be auto-renewed based on the last purchase date.<\/p>"}},"1644918874f596d511-6":{"type":"content","settings":{"title":"6. Can we stack vouchers on top of existing promotion?","answer":"<p>- Vouchers cannot stack with existing discount promotion on the website.<\/p>"}},"1644918874f596d511-7":{"type":"content","settings":{"title":"7. How do I collect loyalty points?","answer":"<p>- Customer would need to first sign up their Trapo account using the same email address when they first placed their order. Please do note that points would be auto credited to your account 7 days after receiving the parcel.<\/p>"}},"921c3f93-90cb-45db-a4e5-ea670fa34207":{"type":"content","settings":{"title":"8. Am I able to still accumulate the loyalty points for my previous order (more than a year) if I create a Trapo account now using the same email address?","answer":"<p>- Validity of the points is only for a year. If points are not claimed within the time frame, it will automatically be invalid.<\/p>"}},"78c000e1-1037-4e8e-a50f-a3b6559b7dc8":{"type":"content","settings":{"title":"9. Does the 2 months extended warranty apply to all orders? How do I claim it?","answer":"<p>- The extended warranty is applicable to car mats order only. Customer may provide us the order number so our team can remark on the extended waranty period in th system<\/p>"}},"78c000e1-1037-4e8e-a50f-a3b6559b7dc81":{"type":"content","settings":{"title":"10. Can I create multiple accounts using the same phone number?","answer":"<p>- No, you cannot. One account is only valid per user with a valid Malaysian phone number. Any multiple accounts created using the same phone number will be under suspicion of fraudulent activity by our system.<\/p>"}}},"block_order":["1644918874f596d5111-1","1644918874f596d511-1","1644918874f596d511-2","1644918874f596d511-3","1644918874f596d511-5","1644918874f596d511-6","1644918874f596d511-7","921c3f93-90cb-45db-a4e5-ea670fa34207","78c000e1-1037-4e8e-a50f-a3b6559b7dc8","78c000e1-1037-4e8e-a50f-a3b6559b7dc81"],"settings":{"title":"FAQ"}}},"order":["main","89209ef1-7e25-4cf1-86f8-7158aeee0fd1","1644918874e4f539b9"]}